# Sakila Database Project

<div class ="alert alert-info">

**!!REMEMBER!!**    
    
**SELECT * | col 1,col 2,.. col n**
    
**FROM Table_name**
    
**WHERE conditions**
    
**GROUP BY col 1, col 2,...**
    
**HAVING conditions**
    
**ORDER BY col 1, col 2,...**
    
**LIMIT n;**

</div>

In [7]:
#Importer les dépendances
import mysql.connector as mysqlConnector

In [12]:
# Se Connecter à la BDD Sakila
#TBD
conn = mysqlConnector.connect(host='Localhost',user='root',passwd='azerty455', database='sakila')
if conn:
    print("Connection Successful!")
else:
    print("Connection Failed!")
cur = conn.cursor()
cur.execute("select * from actor limit 2")
for row in cur:
    print(row)

Connection Successful!
(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))
(2, 'NICK', 'WAHLBERG', datetime.datetime(2006, 2, 15, 4, 34, 33))

In [10]:
# définir la fct sql_to_pandas

def sql_to_df(sql_query):

    # Use pandas to pass sql query using connection form SQLite3
    df = pd.read_sql(sql_query, con)

    # Show the resulting DataFrame
    return df

<div class="alert alert-success">
 
**1-**    
* Afficher les 5 premiers Records de la table Actor
</div>

In [11]:
query = 
#TBD

# Grab from first two columns
sql_to_df(query).head()

SyntaxError: invalid syntax (<ipython-input-11-39e12336ec21>, line 1)

<div class="alert alert-success">
 
**2-**    
* Récupérer dans une colonne Actor_Name le full_name des acteurs sous le format: first_name + " " + last_name

</div>

In [67]:
query =#TBD


sql_to_df(query).head()

            Actor_Name
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

<div class="alert alert-success">
 
**3-**    
* Récupérer dans une colonne Actor_Name le full_name des acteurs sous le format: first_name en minuscule + "." + last_name en majuscule

</div>

**SQL Syntaxes**

SELECT 

    CONCAT(lower(first_name), '.', UPPER(last_name)) AS 'Actor Name'
    
FROM

actor;

In [68]:
query =#TBD


sql_to_df(query).head()

            Actor_Name
0     penelope.GUINESS
1        nick.WAHLBERG
2             ed.CHASE
3       jennifer.DAVIS
4  johnny.LOLLOBRIGIDA

<div class="alert alert-success">
 
**4-**    
* Récupérer dans une colonne Actor_Name le full_name des acteurs sous le format: last_name en majuscule + "." + premiere lettre du first_name en majuscule

</div>

In [69]:
query =#TBD


sql_to_df(query).head()

       Actor_Name
0       GUINESS.P
1      WAHLBERG.N
2         CHASE.E
3         DAVIS.J
4  LOLLOBRIGIDA.J

<div class="alert alert-success">
 
**5-**    
* Trouver le ou les acteurs appelé(s) "JENNIFER"


</div>

In [70]:
query =#TBD


sql_to_df(query).head()

   actor_id first_name last_name
0         4   JENNIFER     DAVIS

<div class="alert alert-success">
 
**6-**    
* Trouver les acteurs ayant des prénoms de 3 charactères.

</div>

In [71]:
query =#TBD


sql_to_df(query).head()

   actor_id first_name last_name
0         9        JOE     SWANK
1        13        UMA      WOOD
2        18        DAN      TORN
3        19        BOB   FAWCETT
4        26        RIP  CRAWFORD

<div class="alert alert-success">
 
**7-**    
* Afficher les acteurs (actor_id, first_name, last_name, nbre char first_name, nbre char last_name )par ordre décroissant de longueur de prénoms

</div>

In [79]:
query =#TBD


sql_to_df(query).head()

   actor_id   first_name last_name  length(first_name)  length(last_name)
0        91  CHRISTOPHER     BERRY                  11                  5
1       163  CHRISTOPHER      WEST                  11                  4
2        10    CHRISTIAN     GABLE                   9                  5
3        58    CHRISTIAN    AKROYD                   9                  6
4        61    CHRISTIAN    NEESON                   9                  6

<div class="alert alert-success">
 
**8-**    
* Afficher les acteurs (actor_id, first_name, last_name, nbre char first_name, nbre char last_name )par ordre décroissant de longueur de prénoms et croissant de longuer de noms

</div>

In [80]:
query =#TBD

sql_to_df(query).head()

   actor_id   first_name last_name  length(first_name)  length(last_name)
0       163  CHRISTOPHER      WEST                  11                  4
1        91  CHRISTOPHER     BERRY                  11                  5
2       109    SYLVESTER      DERN                   9                  4
3        10    CHRISTIAN     GABLE                   9                  5
4        58    CHRISTIAN    AKROYD                   9                  6

<div class="alert alert-success">
 
**9-**    
* Trouver les acteurs ayant dans leurs last_names la chaine: "SON


</div>

In [74]:
query =#TBD


sql_to_df(query).head()

   actor_id first_name  last_name
0         6      BETTE  NICHOLSON
1         8    MATTHEW  JOHANSSON
2        61  CHRISTIAN     NEESON
3        62      JAYNE     NEESON
4        64        RAY  JOHANSSON

<div class="alert alert-success">
 
**10-**    
* Trouver les acteurs ayant des last_names commençant par la chaine: "JOH"


</div>

In [76]:
query =#TBD


sql_to_df(query).head()

   actor_id first_name  last_name
0         8    MATTHEW  JOHANSSON
1        64        RAY  JOHANSSON
2       146     ALBERT  JOHANSSON

<div class="alert alert-success">
 
**11-**    
*  Afficher par ordre alphabétique croissant les last_names et les first_names des acteurs ayant dans leurs last_names la chaine "LI"


</div>

In [77]:
query =#TBD


sql_to_df(query).head()

   actor_id first_name last_name
0        86       GREG   CHAPLIN
1        82      WOODY     JOLIE
2        34     AUDREY   OLIVIER
3        15       CUBA   OLIVIER
4       172    GROUCHO  WILLIAMS

<div class="alert alert-success">
 
**12-**    
*  Trouver dans la table country les countries "China", "Afghanistan", "Bangladesh"


</div>

In [78]:
query =#TBD


sql_to_df(query).head()

   country_id      country
0           1  Afghanistan
1          12   Bangladesh
2          23        China

<div class="alert alert-success">
 
**13-**    
* Trouver le nombre des acteurs ayant le meme last_name
* Afficher le resultat  par ordre décroissant


</div>

In [81]:
query =#TBD


sql_to_df(query).head()

  last_name  Num Actors with Last Name
0    KILMER                          5
1     NOLTE                          4
2    TEMPLE                          4
3    AKROYD                          3
4     ALLEN                          3

<div class="alert alert-success">
 
**14-**    
* Trouver le nombre des acteurs ayant le meme last_name
* Afficher UNIQUEMENT les last_names communs à au moins 3 acteurs 
* Afficher par ordre alph. croissant

</div>

In [82]:
query =#TBD


sql_to_df(query).head()

   last_name  Num Actors
0     AKROYD           3
1      ALLEN           3
2      BERRY           3
3      DAVIS           3
4  DEGENERES           3

<div class="alert alert-success">
 
**15-**    
* Trouver le nombre des acteurs ayant le meme first_name Afficher le resultat par ordre alph. croissant

</div>

In [83]:
query =#TBD


sql_to_df(query).head()

  first_name  Num Actors with Last Name
0       ADAM                          2
1         AL                          1
2       ALAN                          1
3     ALBERT                          2
4       ALEC                          1

<div class="alert alert-success">
 
**16-**    
* Corriger le first_name de l'acteur HARPO WILLIAMS qui était accidentellement inséré à GROUCHO WILLIAMS


</div>

In [84]:
query =#TBD

In [87]:
query ="""
    SELECT * FROM actor 
    where last_name = 'WILLIAMS';"""

sql_to_df(query).head()

   actor_id first_name last_name          last_update
0        72       SEAN  WILLIAMS  2011-09-14 18:05:30
1       137     MORGAN  WILLIAMS  2011-09-14 18:05:31
2       172    GROUCHO  WILLIAMS  2011-09-14 18:05:32

<div class="alert alert-success">
 
**17-**    
* Trouver les first_names,last names et l'adresse de chacun des membre staff 
    
RQ: utiliser join avec les tables staff & address:

</div>

In [88]:
query =#TBD


sql_to_df(query).head()

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive

<div class="alert alert-success">
 
**18-**    
* Afficher pour chaque membre du staff ,le total de ses salaires depuis Aout 2005. RQ: Utiliser les tables staff & payment.

</div>

In [89]:
query =#TBD


sql_to_df(query).head()

   staff_id first_name last_name  Total Purchases
0         1       Mike   Hillyer         33489.47
1         2        Jon  Stephens         33927.04

<div class="alert alert-success">
 
**19-**    
* Afficher pour chaque film ,le nombre de ses acteurs

</div>

In [90]:
query =#TBD


sql_to_df(query).head()

              title  Num Actors
0  ACADEMY DINOSAUR          10
1    ACE GOLDFINGER           4
2  ADAPTATION HOLES           5
3  AFFAIR PREJUDICE           5
4       AFRICAN EGG           5

<div class="alert alert-success">
 
**20-**    
* Trouver le film intitulé "HUNCHBACK IMPOSSIBLE"


</div>

In [91]:
query =#TBD


sql_to_df(query).head()

   film_id
0      439

<div class="alert alert-success">
 
**21-**    
* Combien de copies exist t il dans le systme d'inventaire pour le film Hunchback Impossible

</div>

In [92]:
query =#TBD


sql_to_df(query).head()

   Num Copies
0           6

<div class="alert alert-success">
 
**22-**    
* Afficher les titres des films en anglais commençant par 'K' ou 'Q'

</div>

In [93]:
query =#TBD

sql_to_df(query).head()

              title  language_id
0     KANE EXORCIST            1
1       KARATE MOON            1
2  KENTUCKIAN GIANT            1
3     KICK SAVANNAH            1
4  KILL BROTHERHOOD            1

# Bonus

<div class="alert alert-success">
   
* Afficher les first et last names des acteurs qui ont participé au film intitulé 'ACADEMY DINOSAUR'

</div>

In [94]:
query =#TBD


sql_to_df(query).head()

  first_name last_name
0   PENELOPE   GUINESS
1  CHRISTIAN     GABLE
2    LUCILLE     TRACY
3     SANDRA      PECK
4     JOHNNY      CAGE

<div class="alert alert-success">
    
* Trouver la liste des film catégorisés comme family films.

</div>

In [95]:
query =#TBD

sql_to_df(query).head()

             title
0      AFRICAN EGG
1    APACHE DIVINE
2   ATLANTIS CAUSE
3  BAKED CLEOPATRA
4        BANG KWAI

<div class="alert alert-success">
    
* Afficher le top 5 des films les plus loués par ordre decroissant

</div>

In [96]:
query =#TBD


sql_to_df(query).head()

                  title  Num Rentals
0            MOB DUFFEL        16049
1  HUNCHBACK IMPOSSIBLE        16048
2       ILLUSION AMELIE        16047
3        VOYAGE LEGALLY        16046
4     COMANCHEROS ENEMY        16045

<div class="alert alert-success">
    
* Afficher le chiffre d'affaire par store. RQ: le chiffre d'affaire = somme (amount)

</div>

In [97]:
query =#TBD


sql_to_df(query).head()

   store_id  Total Amount ($)
0         1          33489.47
1         2          33927.04

<div class="alert alert-success">
    
* Lister par ordre décroissant le top 5 des catégories ayant le plus des revenues. 
    
RQ utiliser les tables : category, film_category, inventory, payment, et rental.

</div>

In [98]:
query =#TBD


sql_to_df(query).head()

  Category Name  Revenue
0        Sports  5314.21
1        Sci-Fi  4756.98
2     Animation  4656.30
3         Drama  4587.39
4        Comedy  4383.58

## Bon travail!